/**
 * 
 */

var wuxiarea = ["崇安区","崇安区—崇安寺","崇安区—中山路","崇安区—火车站/上马墩",
                "滨湖区","滨湖区—河埒口","滨湖区—中桥","滨湖区—蠡园/太湖景区",
                "北塘区","北塘区—山北 ","北塘区—五爱广场 ","北塘区—青石路/北大街 ","北塘区—锡惠",
                "南长区","南长区—五爱路","南长区—清扬路","南长区—南禅寺",
                "新区","新区—工业园区","新区—旺庄",
                "锡山区","锡山区—农业园区 ","锡山区—东亭/东北塘",
                "惠山区","惠山区—惠山","惠山区—钱桥",
                "近郊"];

var beijingarea=["朝阳区","朝阳区—国贸 ","朝阳区—双井", "朝阳区—三里屯", "朝阳区—对外经贸","朝阳区—酒仙桥","朝阳区—管庄", "朝阳区—首都机场",
                 "朝阳区—十八里店", "朝阳区—北苑家园","朝阳区—十里堡", 
                 "朝阳区—东坝", "朝阳区—建外大街 ","朝阳区—大望路 ","朝阳区—朝外大街", "朝阳区—朝阳公园/团结湖", "朝阳区—左家庄 ","朝阳区—亮马桥/三元桥",
                 "朝阳区—亚运村", "朝阳区—望京","朝阳区—劲松/潘家园", "朝阳区—安贞", "朝阳区—朝阳其它",
                 "东城区","东城区—地安门","东城区—和平里", "东城区—王府井/东单", "东城区—建国门/北京站", "东城区—东四", "东城区—安定门",
                 "东城区—朝阳门 ","东城区—东直门", "东城区—广渠门 ","东城区—左安门", "东城区—沙子口","东城区—前门", "东城区—崇文门", "东城区—天",
                 "西城区","西城区—西四", "西城区—月坛","西城区—什刹海 ","西城区—德外大街","西城区—西单 ","西城区—复兴门",
                 "西城区—阜成门 ","西城区—西直门/动物园","西城区—新街口 ","西城区—地安门 ","西城区—前门",
                 "西城区—牛街", "西城区—虎坊桥","西城区—菜市口","西城区—广内大街","西城区—广外大街","西城区—宣武门", "西城区—右安门",
                 "海淀区","海淀区—双榆树", "海淀区—五棵松","海淀区—清河 ","海淀区—远大路","海淀区—香山","海淀区—中关村",
                 "海淀区—五道口 ","海淀区—魏公村","海淀区—北太平庄","海淀区—苏州桥",
                 "海淀区—北下关","海淀区—公主坟/万寿路","海淀区—紫竹桥","海淀区—航天桥", "海淀区—上地","海淀区—颐和园","海淀区—海淀其它",
                 "丰台区","丰台区—北大地","丰台区—刘家窑","丰台区—青塔", "丰台区—开阳里","丰台区—草桥", "丰台区—看丹桥", "丰台区—花乡",
                 "丰台区—大红门", "丰台区—公益西桥","丰台区—云岗","丰台区—卢沟桥","丰台区—方庄","丰台区—六里桥/丽泽桥","丰台区—洋桥/木樨园 ","丰台区—丰台其它",
                 "石景山区","石景山区—模式口","石景山区—苹果园","石景山区—古城/八角","石景山区—鲁谷","石景山区—石景山其",
                 "大兴区","大兴区—亦庄", "大兴区—旧宫","大兴区—黄村","大兴区—西红门",
                 "通州区","通州区—果园", "通州区—梨园","通州区—新华大街","通州区—九棵树",
                 "昌平区","昌平区—回龙观 ","昌平区—天通苑", "昌平区—昌平镇", "昌平区—小汤山",
                 "近郊","近郊—平谷","近郊—密云县","近郊—延庆县","近郊—顺义","近郊—门头沟","近郊—房山","近郊—怀柔","近郊—近郊其它"
                ];
//判断字符长度，汉字算2个字节,7个汉字或14个字符
function namelen(s) {
var l = 0;
var a = s.split("");
for (var i=0;i<a.length;i++) {
	if (a[i].charCodeAt(0)<299) {
		l++;
		} else {
		l+=2;
		}
}
return l;
}

function checkTel(value)
{
	var cmccMobile = /^(((13[0-9]{1})|(14[0-9]{1})|(15[0-9]{1})|(18[0-9]{1}))+\d{8})$/;
	var tel = /^(([0\+]\d{2,3}-)?(0\d{2,3})-)?(\d{7,8})(-(\d{3,}))?$/;
	return tel.test(value) || (value.length == 11 && cmccMobile.test(value));
}

function checkNameVal(txtValue) {

	 var forbidChar = new Array("@", "#", "$", "%", "^", "&", "*",
   		  "……", "“", "'", "￥", "×", "\"", "<", ">", "’",
   		  "”","~","·","（）","？","/",";",".",":","{","}","[","]","|","\\","+","=","`","(",")","?","、","；","：","【","】");

    for (var i = 0; i < forbidChar.length; i++) {
        if (txtValue.indexOf(forbidChar[i]) >= 0) {
            return "昵称只支持汉字、数字、字母和下划线";
        }
    }
    return "";
}
